[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:77:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="inactive">Inactive</Form.Label>
         <Form.Check
-          data-testid={`${testIdPrefix}-inactive`}
+          data-testid={``}
           type="checkbox"
           id="inactive"
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-inactive"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
